{
  "backend/main.mo": "Motoko canister managing contacts, appointment requests, user profiles, admin‑only domain drafts, and a decommission mode with full access control.",
  "feature_evidence.json": "Feature evidence report listing branding‑related features, associated components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Aggregated summaries describing the purpose and content of all major frontend components and pages.",
  "frontend/index.css": "Tailwind base layers defining OKLCH color variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "Main HTML document setting metadata, Open Graph tags, icons, and mounting the React app.",
  "frontend/public/robots.txt": "Robots configuration allowing all crawlers and pointing to the sitemap URL.",
  "frontend/public/sitemap.xml": "Sitemap listing all main site routes with change frequency and priority settings.",
  "frontend/src/App.tsx": "React router configuration wiring all pages with SiteLayout, including domain draft and decommissioned routes.",
  "frontend/src/components/forms/AppointmentRequestForm.tsx": "Appointment request form with validation, department selection, success/error states, and submission via custom hook.",
  "frontend/src/components/forms/ContactForm.tsx": "A contact form component with client-side validation, submission via useSubmitContact, and success/error handling.",
  "frontend/src/components/layout/PageHero.tsx": "A hero section component supporting variants, optional badge, subtitle, and cache‑busted background patterns.",
  "frontend/src/components/layout/PageHeroImage.tsx": "Displays a hero image with cache-busting and error fallback UI for generated assets.",
  "frontend/src/components/layout/Section.tsx": "A layout wrapper providing padded sections with optional background variants.",
  "frontend/src/components/layout/SiteFooter.tsx": "The site footer showing branding, contact details, hours, and a cache‑busted logo with error handling.",
  "frontend/src/components/layout/SiteHeader.tsx": "The main header with emergency bar, navigation links, logo, and mobile menu handling.",
  "frontend/src/components/layout/SiteLayout.tsx": "Global page layout combining header, footer, SEO manager, and a main content area.",
  "frontend/src/components/seo/OrganizationJsonLd.tsx": "Injects JSON‑LD schema for the medical organization into the page head.",
  "frontend/src/components/seo/SeoManager.tsx": "Dynamically updates document head tags for SEO based on the current route.",
  "frontend/src/config/branding.ts": "Defines hospital branding constants and a helper for composing page titles.",
  "frontend/src/config/buildInfo.ts": "Exposes build ID and formatted build version for cache‑busting and display.",
  "frontend/src/config/contactDetails.ts": "Centralized contact details plus helpers for emergency and main phone links.",
  "frontend/src/config/seo.ts": "Defines site-wide and per-route SEO metadata plus helpers for titles, descriptions, and canonical URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useDomainDraft.ts": "Provides hooks to fetch and save a domain draft via the backend actor using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identities, and exposing identity state.",
  "frontend/src/hooks/useSubmitAppointmentRequest.ts": "Mutation hook to submit appointment requests through the backend actor with normalized error handling.",
  "frontend/src/hooks/useSubmitContact.ts": "Mutation hook to submit contact form data to the backend actor with user-friendly error handling.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark hospital-themed design tokens and global styles.",
  "frontend/src/main.tsx": "Application entry point initializing React, QueryClient, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero sections, mission/vision cards, facilities image, and core values.",
  "frontend/src/pages/AppointmentRequestPage.tsx": "Renders an appointment request page with hero images, booking steps, consultation photos, and an appointment form.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact info including phone, email, location, hours, and a contact form with supporting images.",
  "frontend/src/pages/DecommissionedPage.tsx": "Shows a decommissioned service notice with hero imagery and a card explaining temporary unavailability.",
  "frontend/src/pages/DoctorsPage.tsx": "Lists medical suites with doctor details, specialties, availability, and supporting hero and team images.",
  "frontend/src/pages/DomainDraftPage.tsx": "Provides a UI for authenticated users to view and save domain drafts, with loading states and hero sections.",
  "frontend/src/pages/EmergencyPage.tsx": "Presents emergency contact info, ambulance details, emergency services, and guidance on when to seek urgent care.",
  "frontend/src/pages/HomePage.tsx": "Home page component with hero section, call‑to‑action buttons, image handling, and cache‑busted asset loading.",
  "frontend/src/pages/NotFoundPage.tsx": "404 page showing navigation help, illustrations, and a button returning users to the home page.",
  "frontend/src/pages/ServicesPage.tsx": "Services listing page displaying medical service cards, hero section, and equipment imagery.",
  "frontend/src/utils/generatedAssets.ts": "Utility functions that detect generated assets and append a cache‑busting build ID to their URLs.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, spacing, shadows, and typography with custom theming.",
  "project_state.json": "Metadata describing project state, logo update requirements, and pending feature requests."
}