{
  "backend/main.mo": "Motoko actor handling contact submissions, appointment requests, admin-only domain drafts, and decommission mode with access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing autogenerated one-line summaries for all frontend files.",
  "frontend/index.css": "Tailwind base styles defining color tokens, dark mode variables, and global styling utilities.",
  "frontend/index.html": "HTML entrypoint setting metadata, favicons, and loading the React app root.",
  "frontend/public/robots.txt": "Robots file allowing all crawlers and referencing the sitemap URL.",
  "frontend/public/sitemap.xml": "XML sitemap listing all site routes including doctor-suites with priorities and changefreq.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all pages including doctor suites, wrapped in SiteLayout.",
  "frontend/src/components/forms/AppointmentRequestForm.tsx": "React form component handling appointment request input, validation, and submission via a mutation hook.",
  "frontend/src/components/forms/ContactForm.tsx": "Form component handling contact submission with validation, success/error states, and integration with useSubmitContact.",
  "frontend/src/components/layout/PageHero.tsx": "Page hero section that displays a title, subtitle, optional badge, and visual variants.",
  "frontend/src/components/layout/Section.tsx": "Generic layout section wrapper supporting default and muted background variants.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying branding, contact details, and hours using centralized config values.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with navigation, emergency contact bar, and mobile menu handling.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main site layout combining header, footer, SEO manager, and a skip-to-content link.",
  "frontend/src/components/seo/OrganizationJsonLd.tsx": "Injects JSON-LD markup describing the medical organization for search engines.",
  "frontend/src/components/seo/SeoManager.tsx": "Dynamically updates document head tags for SEO based on current route.",
  "frontend/src/config/branding.ts": "Defines the hospital name and helper for composing page titles.",
  "frontend/src/config/contactDetails.ts": "Centralized contact details with helpers for emergency and phone tel links.",
  "frontend/src/config/seo.ts": "Site-wide SEO configuration including base URL, route metadata, and helpers for titles and descriptions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor via react-query, reinitializing it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useDomainDraft.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and AuthClient setup.",
  "frontend/src/hooks/useSubmitAppointmentRequest.ts": "Defines a mutation hook that submits appointment requests through the backend actor with normalized error handling.",
  "frontend/src/hooks/useSubmitContact.ts": "Defines a mutation hook to submit contact form data via the backend actor with user-friendly error handling.",
  "frontend/src/index.css": "Tailwind CSS setup with extensive theme variables for light and dark modes and global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero banner, mission/vision cards, and core values grid.",
  "frontend/src/pages/AppointmentRequestPage.tsx": "Renders the appointment request page with steps overview and a form for submitting appointment requests.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information, emergency details, and a contact form within a styled layout.",
  "frontend/src/pages/DecommissionedPage.tsx": "Displays a notice that the site is decommissioned and updates the page title accordingly.",
  "frontend/src/pages/DoctorsPage.tsx": "Lists doctor suites with details like specialties, availability, and navigation support.",
  "frontend/src/pages/DomainDraftPage.tsx": "Empty page placeholder with no implemented content.",
  "frontend/src/pages/EmergencyPage.tsx": "Renders emergency services information, hero section, and service cards with contact actions.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section, emergency contact links, navigation actions, and promotional content.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with messaging and a button to navigate back home.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a services overview with a hero section and grid of medical service cards.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, custom color tokens, spacing, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's state, including features for a Doctor Suites page, deployment notes, known issues, and pending content update requests."
}