{
  "backend/main.mo": "Motoko canister handling contact submissions, appointment requests, admin-only domain drafts, and decommission mode with access control checks.",
  "feature_evidence.json": "Feature evidence report linking a UI background-image feature to relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "Aggregated summaries describing the purpose of major frontend pages, components, hooks, and configuration files.",
  "frontend/index.css": "Global Tailwind-based styles defining OKLCH color variables for light and dark modes and applying base layout rules.",
  "frontend/index.html": "HTML entry point setting up metadata, branding, favicon assets, and the root mount for the React app.",
  "frontend/src/App.tsx": "Application router setup defining all main routes and wrapping them in the SiteLayout component.",
  "frontend/src/components/forms/AppointmentRequestForm.tsx": "Form component for submitting appointment requests with validation, React Query mutation, and success/error states.",
  "frontend/src/components/forms/ContactForm.tsx": "Validated contact form using React Query to submit data and display success or error feedback.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component showing branding, contact info, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation links, branding, and mobile menu handling.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper composing the site header, main content area, and footer.",
  "frontend/src/config/branding.ts": "Defines the hospital name and a helper to format page titles.",
  "frontend/src/config/contactDetails.ts": "Central contact details config with helpers to retrieve phone numbers and tel links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useDomainDraft.ts": "Empty placeholder file for a future domain draft hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context and utilities for login, logout, and identity loading.",
  "frontend/src/hooks/useSubmitAppointmentRequest.ts": "Mutation hook to submit appointment requests via the backend actor with error normalization.",
  "frontend/src/hooks/useSubmitContact.ts": "Mutation hook to submit contact form data through the backend actor with error handling.",
  "frontend/src/index.css": "Tailwind base styles with custom color variables and theme definitions for light and dark modes.",
  "frontend/src/main.tsx": "App bootstrap wiring React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "About page setting document title and rendering sections for mission, vision, values, and features.",
  "frontend/src/pages/AppointmentRequestPage.tsx": "Displays a hero section, appointment process steps, and an appointment request form with page title set on mount.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact details and a contact form, including phone, email, address, and hours, with page title set on mount.",
  "frontend/src/pages/DecommissionedPage.tsx": "Renders an alert indicating the site is decommissioned and no longer accepting submissions.",
  "frontend/src/pages/DoctorsPage.tsx": "Lists doctors with specialties, credentials, and availability, alongside a hero section and styled doctor cards.",
  "frontend/src/pages/DomainDraftPage.tsx": "Empty placeholder file with no content.",
  "frontend/src/pages/EmergencyPage.tsx": "Provides emergency service information, call-to-action button, and service feature cards with page title set on mount.",
  "frontend/src/pages/HomePage.tsx": "Displays hero content, emergency services highlight, and navigation buttons for booking appointments and viewing services.",
  "frontend/src/pages/NotFoundPage.tsx": "Renders a 404 page with a message and button to navigate back home.",
  "frontend/src/pages/ServicesPage.tsx": "React page rendering a services list with icons, hero section, and grid layout, setting the page title on mount.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for getting, storing, retrieving, and clearing URL or session-stored parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and container settings with plugins.",
  "project_state.json": "Project metadata tracking state, issues, and feature requests related to adding uploaded images as profile backgrounds."
}