{
  "backend/main.mo": "Actor implements admin-gated decommission mode, contact and appointment submissions, and domain draft storage using AccessControl and Map.",
  "feature_evidence.json": "Feature evidence report listing UI, responsiveness, and accessibility changes with affected files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend pages, components, forms, hooks, and styling files.",
  "frontend/index.css": "Tailwind base/style definitions using OKLCH variables for light/dark themes and global element styling.",
  "frontend/index.html": "HTML entry file defining metadata, icons, SEO tags, and mounting root for the React app.",
  "frontend/public/robots.txt": "Robots file allowing all crawlers and specifying sitemap location.",
  "frontend/public/sitemap.xml": "Sitemap listing main site routes with priorities and change frequencies.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all main pages wrapped in SiteLayout.",
  "frontend/src/components/forms/AppointmentRequestForm.tsx": "React form handling appointment submissions with validation, department selection, error feedback, and success state.",
  "frontend/src/components/forms/ContactForm.tsx": "A contact form component with validation, submission via hook, and success/error handling.",
  "frontend/src/components/layout/PageHero.tsx": "Renders a styled page hero section with title, subtitle, optional badge, and variant backgrounds.",
  "frontend/src/components/layout/Section.tsx": "Generic layout wrapper that renders a section with variant background styles.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays footer with branding, contact info, hours, and hospital details.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with emergency bar, navigation, branding, and responsive mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper providing header, footer, SEO manager, and skip link.",
  "frontend/src/components/seo/OrganizationJsonLd.tsx": "Injects JSON-LD structured data describing the medical organization.",
  "frontend/src/components/seo/SeoManager.tsx": "Dynamically updates meta tags, title, canonical URL, and social tags based on route.",
  "frontend/src/config/branding.ts": "Defines hospital name and a helper for generating branded page titles.",
  "frontend/src/config/contactDetails.ts": "Centralized contact details with helper functions for emergency and phone links.",
  "frontend/src/config/seo.ts": "Defines SEO config, route metadata, and helpers for titles, descriptions, and URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useDomainDraft.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider to manage authentication, identity loading, and login state.",
  "frontend/src/hooks/useSubmitAppointmentRequest.ts": "Provides a mutation hook that submits appointment request data to the backend via the actor with error normalization.",
  "frontend/src/hooks/useSubmitContact.ts": "Provides a mutation hook that submits contact form data to the backend via the actor with error normalization.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes with a medical-focused color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider setup.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and core values using cards and themed sections.",
  "frontend/src/pages/AppointmentRequestPage.tsx": "Displays the appointment request workflow with steps and a form wrapped in styled UI components.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact details and a contact form, including emergency info and contact links.",
  "frontend/src/pages/DecommissionedPage.tsx": "Displays a notice that the site is decommissioned and updates the page title accordingly.",
  "frontend/src/pages/DoctorsPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/DomainDraftPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/EmergencyPage.tsx": "Renders the emergency services page with a hero section, call button, service cards, and guidance on when to seek emergency care.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero section, appointment and Google search actions, and featured medical team imagery.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a 404 page with messaging and a button to return home.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a hero section and a grid of medical services with icons and descriptions.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme settings, colors, typography, container settings, and custom utilities.",
  "project_state.json": "Defines the project state for improving a hospital website’s visual quality, listing existing UI, responsive, accessibility, and imagery features. Includes required images, project metadata, and one pending feature request."
}