{
  "backend/main.mo": "Actor manages contacts, appointment requests, user profiles, domain drafts, and admin-controlled decommission mode using access control and persistent maps.",
  "feature_evidence.json": "Feature evidence listing site restyling and layout updates with associated files, components, and requirement mappings.",
  "frontend-file-summaries.txt": "Aggregated summaries of all frontend components, pages, hooks, forms, and styles for quick reference.",
  "frontend/index.css": "Tailwind base layers with OKLCH color variables and light/dark theme tokens applied globally.",
  "frontend/index.html": "Static HTML entry point defining metadata, SEO tags, icons, and root mount for the React app.",
  "frontend/public/robots.txt": "Robots configuration allowing all crawlers and declaring sitemap location.",
  "frontend/public/sitemap.xml": "XML sitemap listing main site URLs with priorities and change frequencies.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all pages wrapped in SiteLayout.",
  "frontend/src/components/forms/AppointmentRequestForm.tsx": "Form component for submitting appointment requests with validation, success/error handling, and department selection.",
  "frontend/src/components/forms/ContactForm.tsx": "Implements a contact form with validation, submission via a custom hook, and success/error handling.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with branding, contact info, hours, and attribution links.",
  "frontend/src/components/layout/SiteHeader.tsx": "Provides a responsive site header with navigation, emergency contact info, and Google search link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps all pages with SEO management, header, footer, and layout structure.",
  "frontend/src/components/seo/OrganizationJsonLd.tsx": "Injects JSON‑LD structured data describing the medical organization.",
  "frontend/src/components/seo/SeoManager.tsx": "Dynamically updates document head tags for SEO based on the current route.",
  "frontend/src/config/branding.ts": "Defines hospital branding constants and a helper to build page titles.",
  "frontend/src/config/contactDetails.ts": "Stores centralized contact details and utilities for generating phone links.",
  "frontend/src/config/seo.ts": "Defines SEO configuration, per‑route metadata, and helpers for generating titles and URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to user identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useDomainDraft.ts": "File exists but contains no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using Dfinity AuthClient, including login, identity loading, and status handling.",
  "frontend/src/hooks/useSubmitAppointmentRequest.ts": "Defines a mutation hook that sends appointment request data to the backend actor with normalized error handling.",
  "frontend/src/hooks/useSubmitContact.ts": "Defines a mutation hook to submit contact form data through the backend actor with user-friendly error handling.",
  "frontend/src/index.css": "Sets global Tailwind styles and defines a custom light/dark medical-themed design system using CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, core values, and feature sections using UI cards and icons.",
  "frontend/src/pages/AppointmentRequestPage.tsx": "Displays the appointment request flow, including steps overview and the appointment request form.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact details and a contact form, including phone, email, address, and hours sections.",
  "frontend/src/pages/DecommissionedPage.tsx": "Displays a notice informing users the site is decommissioned and no longer accepting submissions.",
  "frontend/src/pages/DoctorsPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/DomainDraftPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/EmergencyPage.tsx": "Renders a detailed emergency services page with a hero call button, service cards, and information sections.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero content, navigation buttons, images, and Google search link plus SEO metadata.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a simple 404 page with title update and button to return home.",
  "frontend/src/pages/ServicesPage.tsx": "Provides a services overview page listing medical services with icons and navigation options.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, container settings, animations, and custom utilities.",
  "project_state.json": "Defines the current project state for restyling a website to resemble the Kavurey Hospital site, including existing features and a pending new feature request. Contains metadata like schema version, project name, and design requirements."
}