{
  "backend/main.mo": "Motoko actor handling access-controlled contact submissions, appointment requests, domain draft storage, and decommission mode using persistent Map states.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing concise descriptions of various frontend components and pages.",
  "frontend/index.css": "Tailwind CSS base layer defining OKLCH color variables, dark mode values, and global styling tokens.",
  "frontend/index.html": "HTML document setting metadata, icons, and mounting point for the React app.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and specifying sitemap location.",
  "frontend/public/sitemap.xml": "Sitemap XML defining crawl URLs, change frequencies, and priorities.",
  "frontend/src/App.tsx": "Main React router configuration wiring all app routes inside the SiteLayout.",
  "frontend/src/components/forms/AppointmentRequestForm.tsx": "Appointment request form with validation, submission via custom hook, and success/error handling.",
  "frontend/src/components/forms/ContactForm.tsx": "General contact form supporting validation, submission, and success/error alerts.",
  "frontend/src/components/layout/PageHero.tsx": "Page hero section with optional subtitle, badge, variant backgrounds, and pattern cache-busting.",
  "frontend/src/components/layout/PageHeroImage.tsx": "Hero image component with cache-busting, error fallback for generated assets, and configurable positioning.",
  "frontend/src/components/layout/Section.tsx": "Layout section wrapper providing background variants and standard spacing.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with logo, contact info, hours, and build/version details including cache-busted assets.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation, emergency contact bar, and mobile menu handling.",
  "frontend/src/components/layout/SiteLayout.tsx": "Overall page layout wrapper including header, footer, SEO manager, and main content area.",
  "frontend/src/components/seo/OrganizationJsonLd.tsx": "Outputs JSON-LD structured data describing the medical organization for SEO.",
  "frontend/src/components/seo/SeoManager.tsx": "Updates document head tags based on the current route, including title, meta, Open Graph, Twitter, and canonical tags.",
  "frontend/src/config/branding.ts": "Defines the hospital name and a helper to compose page titles with branding.",
  "frontend/src/config/buildInfo.ts": "Generates a build ID for cache-busting and formats a user-friendly build version.",
  "frontend/src/config/contactDetails.ts": "Centralizes hospital contact info and provides helpers for emergency and phone tel links.",
  "frontend/src/config/seo.ts": "Defines site-wide SEO metadata, per-route SEO settings, and helpers to build titles, descriptions, and canonical URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useDomainDraft.ts": "Provides hooks to fetch and save a domain draft through the backend actor with React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, managing identities, login flow, and persistence.",
  "frontend/src/hooks/useSubmitAppointmentRequest.ts": "Submits appointment requests via the backend actor and normalizes errors for user-friendly messages.",
  "frontend/src/hooks/useSubmitContact.ts": "Handles contact form submissions through the backend actor with basic error normalization.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and CSS variables for light/dark themes with a medical color palette.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with React Query and Internet Identity providers before rendering.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero section, mission and vision cards, facility images, and core values grid.",
  "frontend/src/pages/AppointmentRequestPage.tsx": "Displays appointment booking steps, consultation room image, and an appointment request form.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact details, reception image, and a contact form within structured sections.",
  "frontend/src/pages/DecommissionedPage.tsx": "Shows a decommissioned service notice with related illustrations and an informational card.",
  "frontend/src/pages/DoctorsPage.tsx": "Lists doctor suites with details and displays hero and team images.",
  "frontend/src/pages/DomainDraftPage.tsx": "Manages domain draft creation and editing with authentication checks and draft loading/saving UI.",
  "frontend/src/pages/EmergencyPage.tsx": "Renders the emergency services page with hero sections, emergency contact alert, service list, and images.",
  "frontend/src/pages/HomePage.tsx": "Defines the homepage with hero content, navigation actions, Google search link, and cache-busted hero images.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 not‑found page with hero artwork, guidance imagery, and a button to return home.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a comprehensive list of medical services with icons, hero imagery, and navigation support.",
  "frontend/src/utils/generatedAssets.ts": "Provides helpers to detect generated assets and append cache‑busting version parameters to their URLs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query, hash, and session storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, spacing, typography, shadows, and container settings for the project.",
  "project_state.json": "Defines the website project’s state, required new images, and existing features focused on adding photos across all pages. Includes architectural notes, pending requests, and metadata for build planning."
}