{
  "backend/main.mo": "Actor canister handling contacts, appointment requests, domain drafts, and decommission mode with admin‑gated access control.",
  "feature_evidence.json": "Report mapping a homepage background‑image feature to affected files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend pages, components, hooks, and configuration files.",
  "frontend/index.css": "Global Tailwind CSS theme defining OKLCH color tokens for light and dark modes and base styling rules.",
  "frontend/index.html": "HTML entry point setting the site title and favicon assets and loading the React app root.",
  "frontend/src/App.tsx": "Sets up TanStack Router with layout and routes for all major pages including home, services, and emergency.",
  "frontend/src/components/forms/AppointmentRequestForm.tsx": "Validated appointment request form submitting data via a mutation hook with success and error states.",
  "frontend/src/components/forms/ContactForm.tsx": "Validated contact form that posts user messages to the backend and displays submission feedback.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer showing branding, contact details, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Provides a responsive header with navigation links, mobile menu, and branding.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps pages with a consistent header, footer, and main content area.",
  "frontend/src/config/branding.ts": "Defines the hospital name and a helper for composing page titles.",
  "frontend/src/config/contactDetails.ts": "Centralizes contact info and exports helpers for retrieving emergency and phone links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's Internet Identity, invalidating queries on change.",
  "frontend/src/hooks/useDomainDraft.ts": "Empty placeholder file for a hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for Internet Identity authentication and identity management.",
  "frontend/src/hooks/useSubmitAppointmentRequest.ts": "Mutation hook for submitting appointment requests through the backend actor with error normalization.",
  "frontend/src/hooks/useSubmitContact.ts": "Mutation hook for submitting contact forms via the backend actor with standardized error handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom color palette for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, values, and styling, setting the page title on mount.",
  "frontend/src/pages/AppointmentRequestPage.tsx": "Displays an appointment booking page with steps overview and a form for submitting appointment requests.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact details (phone, email, address, hours) and provides a contact form for user inquiries.",
  "frontend/src/pages/DecommissionedPage.tsx": "Renders a notice indicating the site is decommissioned and no longer accepting submissions.",
  "frontend/src/pages/DoctorsPage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/DomainDraftPage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/EmergencyPage.tsx": "Outlines 24/7 emergency services with call-to-action buttons and informational cards about emergency care.",
  "frontend/src/pages/HomePage.tsx": "Home landing page featuring hero section, appointment and services navigation, and an emergency services highlight.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 error message with a button to navigate back to the home page.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a hero section and a large grid of medical services, each with icon, title, and description.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), store and retrieve them in sessionStorage, and clear them from storage or the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, shadows, animations, and plugins for the project’s styling.",
  "project_state.json": "Describes the current project state, including features, requests, metadata, and configuration details."
}