{
  "backend/main.mo": "Motoko actor handling access-controlled user profiles, contact submissions, appointment requests, and admin-only domain draft storage.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color variables for light/dark themes and global styling rules.",
  "frontend/index.html": "HTML entry point setting metadata, favicon links, and bootstrap script for the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps all pages in the SiteLayout container.",
  "frontend/src/components/forms/AppointmentRequestForm.tsx": "Form component for submitting appointment requests with validation, submission handling, and success feedback.",
  "frontend/src/components/forms/ContactForm.tsx": "Validated contact form that submits messages to the backend and displays success or error states.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component showing branding, quick links, and contact info using config values.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation links, mobile menu, and branding.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper composing header, footer, and page content.",
  "frontend/src/config/branding.ts": "Defines hospital name and a helper for generating page titles.",
  "frontend/src/config/contactDetails.ts": "Centralized configuration for hospital contact and hours information.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useDomainDraft.ts": "Provides hooks for fetching and saving domain draft data via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements authentication context using Internet Identity with login, logout, and identity persistence.",
  "frontend/src/hooks/useSubmitAppointmentRequest.ts": "Mutation hook to submit appointment requests and invalidate appointment queries.",
  "frontend/src/hooks/useSubmitContact.ts": "Mutation hook to submit contact form data and refresh related queries.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining the application's color theme.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "About page rendering mission, values, and hospital information with dynamic page title.",
  "frontend/src/pages/AppointmentRequestPage.tsx": "Appointment booking page with hero text, steps overview, and an appointment request form.",
  "frontend/src/pages/ContactPage.tsx": "Contact page displaying phone, email, address, hours, and a contact form.",
  "frontend/src/pages/DoctorsPage.tsx": "Empty or placeholder doctors page with no implemented content.",
  "frontend/src/pages/DomainDraftPage.tsx": "Authenticated page to view and edit a domain draft with save functionality and status alerts.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section, emergency notice, and highlights of core services.",
  "frontend/src/pages/NotFoundPage.tsx": "404 error page offering navigation back to the home page.",
  "frontend/src/pages/ServicesPage.tsx": "Services overview page listing multiple medical specialties with icons and descriptions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings with custom theme variables and plugins.",
  "project_state.json": "Defines the project’s metadata, existing features, and pending feature requests related to domain draft state management."
}