{
  "kind": "build_request",
  "title": "Add uploaded image as profile background",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add the two user-uploaded images (Screenshot_2026-02-04-17-14-58-73_1c337646f29875672b5a61192b9010f9-1.jpg and unnamed.webp) to the frontend as static assets with their original filenames so they can be referenced by the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-8"
        ],
        "quotes": [
          "ADD PROFILE BACKROUNG THIS IMAGE",
          "ADD THIS IMAGE"
        ]
      },
      "acceptanceCriteria": [
        "Both files are present in the frontend public static assets directory and are served by the app build without renaming.",
        "The files can be referenced via a stable URL path in React (no backend involvement)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Use the uploaded image(s) as a visible \"profile background\" in the existing UI by applying one of the uploaded images as the background for the Doctors page doctor profile cards (e.g., a banner area at the top of each doctor card or behind an avatar area), ensuring it is responsive and does not reduce text readability.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-8"
        ],
        "quotes": [
          "ADD PROFILE BACKROUNG THIS IMAGE",
          "ADD THIS IMAGE"
        ]
      },
      "acceptanceCriteria": [
        "The Doctors page renders with the chosen uploaded image visible as a background element for each doctor profile card (or an equivalent clearly doctor-profile-related UI region).",
        "Text over the background remains readable (e.g., via overlay, blur, tint, or layout separation) on mobile and desktop.",
        "No user-facing text is added in a language other than English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only). Compose these components instead.",
    "Do not modify immutable hook entrypoints listed in SYSTEM_CONTEXT (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep the backend as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Implementing a user account/profile system or Internet Identity-driven profile pages.",
    "Image uploading from within the app UI (use the provided uploaded files only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}