{
  "kind": "build_request",
  "title": "Set uploaded image as Home page background",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add the uploaded image file \"download.webp\" to the frontend static assets so it can be referenced by URL at runtime (e.g., place it under the public assets path) without going through the backend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ADD THIS IMAGE BACKGROUND IN HOME PAGE"
        ]
      },
      "acceptanceCriteria": [
        "The repository includes the image file \"download.webp\" in a public/static assets location that is served by the frontend build.",
        "The image can be loaded in the browser via a stable URL path (no backend calls required)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Home page to use the uploaded image \"download.webp\" as a background image for the Home page hero section (the first/hero section on \"/\"), while preserving readability of existing hero text and buttons (add an overlay or other styling as needed).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ADD THIS IMAGE BACKGROUND IN HOME PAGE"
        ]
      },
      "acceptanceCriteria": [
        "On route \"/\", the hero section renders with \"download.webp\" as its background image.",
        "Hero heading, paragraph text, and CTA buttons remain readable on top of the background (e.g., via a semi-transparent overlay/gradient).",
        "The background scales/crops responsively (no obvious stretching) across mobile and desktop viewports.",
        "No other pages/routes are affected."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui or any other immutablePaths listed in SYSTEM_CONTEXT.",
    "Do not route static images through the backend; serve them as frontend static assets."
  ],
  "nonGoals": [
    "Changing the site-wide theme/colors/typography beyond what is necessary to ensure hero text readability on the new background.",
    "Replacing the existing hero foreground image unless required for layout/readability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}