{
  "kind": "build_request",
  "title": "Create and apply a new logo set (header/footer + favicons)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a new brand logo for \"Mahalaxmi Health Care\" and update the app’s existing logo assets so the new logo appears in the site header and footer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "CREAT A NEW LOGO"
        ]
      },
      "acceptanceCriteria": [
        "A new logo design is produced and saved as a generated static asset in frontend/public/assets/generated.",
        "The Site Header uses /assets/generated/mahalaxmi-health-care-logo.dim_512x512.png for the brand mark (as in frontend/src/components/layout/SiteHeader.tsx).",
        "The Site Footer uses /assets/generated/mahalaxmi-health-care-logo.dim_512x512.png (with cache-busting) and renders without triggering the logo error state (as in frontend/src/components/layout/SiteFooter.tsx)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the site favicon and Apple touch icon assets to match the new logo, keeping the filenames referenced by the HTML head so browsers pick up the new branding without code changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "CREAT A NEW LOGO"
        ]
      },
      "acceptanceCriteria": [
        "The following icon files exist in frontend/public/assets/generated and visually match the new logo: mahalaxmi-health-care-favicon.dim_32x32.png, mahalaxmi-health-care-favicon.dim_192x192.png, mahalaxmi-health-care-apple-touch-icon.dim_180x180.png.",
        "frontend/index.html continues to reference these exact filenames, and the icons display correctly in the browser tab and on mobile home screen shortcuts (where supported)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not modify immutable hook files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Do not add new backend services or external dependencies; this change should be implemented via static assets and existing frontend references."
  ],
  "nonGoals": [
    "No changes to backend (Motoko) logic or data models.",
    "No changes to site navigation, page content, or SEO text beyond swapping the logo/icon images."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Redesign the logo with a fresh look while keeping a clean, healthcare-appropriate style (mahalaxmi-health-care-logo.dim_512x512.png > mahalaxmi-health-care-logo.dim_512x512.png)",
      "Update the 32x32 favicon to match the new logo (mahalaxmi-health-care-favicon.dim_32x32.png > mahalaxmi-health-care-favicon.dim_32x32.png)",
      "Update the 192x192 favicon to match the new logo (mahalaxmi-health-care-favicon.dim_192x192.png > mahalaxmi-health-care-favicon.dim_192x192.png)",
      "Update the 180x180 Apple touch icon to match the new logo (mahalaxmi-health-care-apple-touch-icon.dim_180x180.png > mahalaxmi-health-care-apple-touch-icon.dim_180x180.png)"
    ]
  }
}