{
  "kind": "build_request",
  "title": "Improve hospital website quality and visual polish",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Improve overall UI quality across all public pages (Home, About, Services, Emergency, Contact, Appointments, and 404) by applying consistent spacing, typography scale, section layout, and component styling (cards, buttons, icons) to achieve a polished, modern hospital website look and feel, without changing the meaning of existing content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "I WANT HIG QUALITY WEB SITE"
        ]
      },
      "acceptanceCriteria": [
        "All pages share a consistent visual system (typography, spacing, shadows, borders, radii) with no obvious mismatched styles between sections/components.",
        "Buttons, cards, and form elements have consistent hover/active/focus states and alignment across pages.",
        "No content is removed; only presentation/layout/styling changes are made."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Perform a responsive design pass to ensure the site looks high-quality on mobile, tablet, and desktop (including navigation/header, hero sections, multi-column grids, and forms), preventing overflow, cramped layouts, and inconsistent section padding.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "I WANT HIG QUALITY WEB SITE"
        ]
      },
      "acceptanceCriteria": [
        "No horizontal scrolling on common viewport widths (mobile through desktop).",
        "Key grids (services, trust signals, cards) reflow cleanly with sensible spacing and readable text sizes.",
        "Header navigation and CTAs remain usable and visually balanced on mobile."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve accessibility and perceived quality by ensuring interactive elements have visible focus styles, sufficient contrast, and appropriate semantic structure (headings hierarchy, labels, button/anchor usage) across the site.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "I WANT HIG QUALITY WEB SITE"
        ]
      },
      "acceptanceCriteria": [
        "Keyboard navigation works across header navigation and page CTAs with clear focus indication.",
        "Forms have proper labels and validation messaging remains readable and accessible.",
        "Headings follow a logical hierarchy (e.g., one H1 per page area, H2/H3 used consistently in sections)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add high-quality, consistent medical-themed imagery as static assets and integrate them into the existing layout where appropriate (without adding new product features), ensuring images are optimized and look sharp on high-DPI displays.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "I WANT HIG QUALITY WEB SITE"
        ]
      },
      "acceptanceCriteria": [
        "New generated images are saved under frontend/public/assets/generated and referenced directly via static paths (no backend image routing).",
        "Images are used with proper aspect ratios, include descriptive alt text, and do not cause layout shift.",
        "Visual style of images matches the site’s hospital theme and feels cohesive with the existing hero image."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services or external databases.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding new backend features (e.g., new data models, new admin panels, new authentication methods beyond Internet Identity).",
    "Adding real-time features (websockets/live chat) or third-party integrations not already present.",
    "Changing hospital name/branding content semantics (copy changes beyond minor readability tweaks are out of scope)."
  ],
  "imageRequirements": {
    "required": [
      "Wide hospital reception/modern facility banner illustration/photo style (facility-banner.dim_1600x600.png)",
      "Medical team/doctor consultation hero-style image (doctors-hero.dim_1600x700.png)",
      "Abstract medical pattern/texture background suitable for subtle section backdrops (medical-pattern.dim_1800x1200.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "User wants a high-quality, polished hospital website."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}