{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Domain Draft page with authenticated save and draft status display",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a Domain Draft page with a routed UI to load, display, and save a single draft domain value using existing actor + React Query patterns.",
      "acceptanceCriteria": [
        "A new route is added in the TanStack Router (frontend/src/App.tsx) that renders a Domain Draft page (path name is consistent with existing routes, e.g. \"/domain-draft\").",
        "The page includes a text input for the domain and a \"Save draft\" button.",
        "The page displays the currently saved draft domain (if any) and a human-readable last-updated time (if any).",
        "All user-facing text on the page is in English.",
        "The page uses the existing actor setup (useActor) and React Query conventions for loading/success/error states."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DomainDraftPage.tsx",
          "operation": "create",
          "description": "Create the Domain Draft page UI: load current draft via React Query, display draft content and formatted last-saved time, provide a domain text input and a Save draft button, and show loading/error/success states using shadcn-ui (e.g., Card, Alert, Input, Button). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useDomainDraft.ts",
          "operation": "create",
          "description": "Add React Query hooks for domain draft state: a query hook that reads the current draft from the backend via useActor, and a mutation hook that saves the draft and invalidates the query. Keep enabled/actor-ready behavior consistent with existing hooks. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new TanStack Router route (e.g., \"/domain-draft\") that renders DomainDraftPage and ensure it is included in the route tree so it is reachable via navigation."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Add a navigation link to the new \"/domain-draft\" route so users can discover the Domain Draft page from the existing header navigation."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Gate the save action behind Internet Identity authentication, disabling save when anonymous and showing a clear English login-required message.",
      "acceptanceCriteria": [
        "When the user is anonymous/not logged in, the Domain Draft page disables the save action and shows an English message indicating login is required to save.",
        "When logged in, the save action is enabled and successfully calls the backend update method.",
        "The implementation does not modify any files under frontend/immutablePaths (it composes existing hooks/components instead)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DomainDraftPage.tsx",
          "operation": "modify",
          "description": "Use the existing Internet Identity hook (useInternetIdentity) to detect authentication state; when anonymous, disable the Save draft button and render a clear English message that login is required to save. When authenticated, enable saving and call the backend save capability via the mutation hook; handle authorization/call failures with a user-friendly error state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useDomainDraft.ts",
          "operation": "modify",
          "description": "Ensure the save mutation validates that an actor is available and supports authenticated saving; keep error handling consistent with existing mutation hooks and invalidate the domain draft query on success."
        }
      ]
    }
  ]
}